danielinux/m33mu/cpu/m2354/m2354_mmio.c
/* m33mu -- an ARMv8-M Emulator
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */

#include <string.h>
#include "m2354/m2354_mmio.h"
#include "m2354/cpu_config.h"
#include "m33mu/code_cache.h"
#include "m33mu/flash_persist.h"
#include "m33mu/memmap.h"
#include "m33mu/mmio.h"

/*
 * Nuvoton M2354 system peripherals: SYS, CLK, FMC and SCU, plus register-file
 * stubs for the blocks firmware touches on the way past.  Register offsets and
 * reset values are taken from the M2354 Series TRM Rev 1.01 and cross-checked
 * against the NuMicro_DFP CMSIS pack.
 *
 * Every region is registered twice: once at its secure base and once at the
 * non-secure alias, base + 0x10000000.
 */

/* --- SYS (0x40000000) --- */
#define SYS_BASE        0x40000000u
#define SYS_SIZE        0x200u
#define SYS_PDID        0x000u
#define SYS_RSTSTS      0x004u
#define SYS_REGLCTL     0x100u
#define SYS_PLCTL       0x1F8u
#define SYS_PLSTS       0x1FCu

#define SYS_PDID_VALUE  0x00235400u
#define SYS_PLCTL_WRBUSY  (1u << 7)
#define SYS_PLSTS_PLCBUSY (1u << 0)

/* --- CLK (0x40000200) --- */
#define CLK_BASE        0x40000200u
#define CLK_SIZE        0x100u
#define CLK_PWRCTL      0x00u
#define CLK_AHBCLK      0x04u
#define CLK_APBCLK0     0x08u
#define CLK_APBCLK1     0x0Cu
#define CLK_CLKSEL0     0x10u
#define CLK_CLKDIV0     0x20u
#define CLK_PLLCTL      0x40u
#define CLK_STATUS      0x50u

#define CLK_PWRCTL_HXTEN    (1u << 0)
#define CLK_PWRCTL_LXTEN    (1u << 1)
#define CLK_PWRCTL_HIRCEN   (1u << 2)
#define CLK_PWRCTL_LIRCEN   (1u << 3)
#define CLK_PWRCTL_HIRC48EN (1u << 18)
#define CLK_PWRCTL_MIRCEN   (1u << 21)

#define CLK_STATUS_HXTSTB    (1u << 0)
#define CLK_STATUS_LXTSTB    (1u << 1)
#define CLK_STATUS_PLLSTB    (1u << 2)
#define CLK_STATUS_LIRCSTB   (1u << 3)
#define CLK_STATUS_HIRCSTB   (1u << 4)
#define CLK_STATUS_MIRCSTB   (1u << 5)
#define CLK_STATUS_HIRC48STB (1u << 6)

#define CLK_PLLCTL_PD       (1u << 16)

/* Oscillator nominal rates.  HXT is 12 MHz on the NuMaker-M2354 board. */
#define M2354_FREQ_HXT      12000000ull
#define M2354_FREQ_LXT      32768ull
#define M2354_FREQ_LIRC     32000ull
#define M2354_FREQ_MIRC     4000000ull
#define M2354_FREQ_HIRC     12000000ull
#define M2354_FREQ_HIRC48   48000000ull

/* --- FMC (0x4000C000) --- */
#define FMC_BASE        0x4000C000u
#define FMC_SIZE        0x200u
#define FMC_ISPCTL      0x00u
#define FMC_ISPADDR     0x04u
#define FMC_ISPDAT      0x08u
#define FMC_ISPCMD      0x0Cu
#define FMC_ISPTRG      0x10u
#define FMC_ISPSTS      0x40u
#define FMC_CYCCTL      0x4Cu
#define FMC_MPDAT0      0x80u
#define FMC_MPDAT1      0x84u
#define FMC_MPDAT2      0x88u
#define FMC_MPDAT3      0x8Cu
#define FMC_MPSTS       0xC0u
#define FMC_MPADDR      0xC4u

#define FMC_ISPCTL_ISPEN   (1u << 0)
#define FMC_ISPCTL_APUEN   (1u << 3)
#define FMC_ISPCTL_CFGUEN  (1u << 4)
#define FMC_ISPCTL_LDUEN   (1u << 5)
#define FMC_ISPCTL_ISPFF   (1u << 6)
#define FMC_ISPTRG_ISPGO   (1u << 0)
#define FMC_ISPSTS_ISPBUSY (1u << 0)
#define FMC_ISPSTS_ISPFF   (1u << 6)
#define FMC_ISPSTS_ALLONE  (1u << 7)
#define FMC_ISPSTS_VECMAP_Msk (0x7FFFu << 9)

#define FMC_CMD_READ        0x00u
#define FMC_CMD_READ_UID    0x04u
#define FMC_CMD_READ_ALL1   0x08u
#define FMC_CMD_READ_CID    0x0Bu
#define FMC_CMD_READ_DID    0x0Cu
#define FMC_CMD_READ_CKS    0x0Du
#define FMC_CMD_PROGRAM     0x21u
#define FMC_CMD_PAGE_ERASE  0x22u
#define FMC_CMD_BANK_ERASE  0x23u
#define FMC_CMD_PROGRAM_MUL 0x27u
#define FMC_CMD_RUN_ALL1    0x28u
#define FMC_CMD_RUN_CKS     0x2Du
#define FMC_CMD_VECMAP      0x2Eu

#define FMC_ALL1_BLANK      0xA11FFFFFu
#define FMC_MULTI_WORD_SIZE 16u
#define FMC_BANK_SIZE       0x80000u

/* Information blocks reachable only through the ISP engine, not through the
 * memory map: LDROM, the XOM/NSCBA page and user CONFIG. */
#define M2354_LDROM_BASE    0x00100000u
#define M2354_LDROM_SIZE    0x4000u
#define M2354_INFO_BASE     0x00210000u
#define M2354_INFO_SIZE     0x1000u
#define M2354_NSCBA_OFFSET  0x800u
#define M2354_CONFIG_BASE   0x00300000u
#define M2354_CONFIG_SIZE   0x10u

/*
 * NSCBA is a config word programmed at production, not a reset value.  On an
 * erased part it reads 0xFFFFFFFF and the whole of flash is secure, which
 * makes the TrustZone wolfBoot build panic in its SCU_FNSADDR check.  Default
 * to the 512 KB boundary that config/examples/m2354-tz.config expects so those
 * images run unmodified; firmware can still reprogram it through the ISP.
 */
#define M2354_NSCBA_DEFAULT 0x00080000u

/* --- SCU (0x4002F000) --- */
#define SCU_BASE        0x4002F000u
#define SCU_SIZE        0x500u
#define SCU_FNSADDR     0x028u

/* --- IDAU region numbers reported for the non-secure aliases --- */
#define M2354_IDAU_REGION_FLASH_NS   0x01u
#define M2354_IDAU_REGION_RAM_NS     0x02u
#define M2354_IDAU_REGION_PERIPH_NS  0x03u

static struct mm_memmap *g_map;
static const struct mm_flash_persist *g_persist;
static mm_u8 *g_flash_ptr;
static mm_u32 g_flash_size;

static mm_u32 sys_regs[SYS_SIZE / 4u];
static mm_u32 clk_regs[CLK_SIZE / 4u];
static mm_u32 fmc_regs[FMC_SIZE / 4u];
static mm_u32 scu_regs[SCU_SIZE / 4u];

static mm_u32 sys_unlock_step;
static mm_bool sys_unlocked;

static mm_u8 ldrom_buf[M2354_LDROM_SIZE];
static mm_u8 info_buf[M2354_INFO_SIZE];
static mm_u8 config_buf[M2354_CONFIG_SIZE];
static mm_bool info_initialized;

static mm_u32 fmc_all1_result;
static mm_u32 fmc_checksum;

/* ------------------------------------------------------------------ */
/* Generic register-file stub                                          */
/* ------------------------------------------------------------------ */

struct periph_stub {
    mm_u32  size;
    mm_u32 *regs;
};

static mm_bool stub_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    const struct periph_stub *ps = (const struct periph_stub *)opaque;
    if (ps == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    *value_out = 0u;
    memcpy(value_out, (const mm_u8 *)ps->regs + offset, size_bytes);
    return MM_TRUE;
}

