danielinux/m33mu/cpu/m2354/m2354_mmio.c
static mm_bool stub_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    struct periph_stub *ps = (struct periph_stub *)opaque;
    if (ps == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    memcpy((mm_u8 *)ps->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

#define DECL_STUB(N, S) \
    static mm_u32 N##_regs[(S) / 4u]; \
    static struct periph_stub N##_stub = { (S), N##_regs }

DECL_STUB(intctl,  0x100u);   /* INT     0x40000300 */
DECL_STUB(gpio,    0x1000u);  /* GPIO    0x40004000 */
DECL_STUB(pdma0,   0x1000u);  /* PDMA0   0x40008000 */
DECL_STUB(pdma1,   0x1000u);  /* PDMA1   0x40018000 */
DECL_STUB(ebi,     0x100u);   /* EBI     0x40010000 */
DECL_STUB(fvc,     0x100u);   /* FVC     0x4002F500 */
DECL_STUB(dpm,     0x100u);   /* DPM     0x4002F600 */
DECL_STUB(plm,     0x100u);   /* PLM     0x4002F700 */
DECL_STUB(btf,     0x100u);   /* BTF     0x4002F800 */
DECL_STUB(crc,     0x100u);   /* CRC     0x40031000 */
DECL_STUB(crpt,    0x1000u);  /* CRPT    0x40032000 */
DECL_STUB(wdt,     0x100u);   /* WDT     0x40040000 */
DECL_STUB(wwdt,    0x100u);   /* WWDT    0x40040100 */
DECL_STUB(rtc,     0x200u);   /* RTC     0x40041000 */
DECL_STUB(spi0,    0x100u);   /* SPI0    0x40061000 */
DECL_STUB(spi1,    0x100u);   /* SPI1    0x40062000 */
DECL_STUB(spi2,    0x100u);   /* SPI2    0x40063000 */
DECL_STUB(spi3,    0x100u);   /* SPI3    0x40064000 */
DECL_STUB(i2c0,    0x100u);   /* I2C0    0x40080000 */
DECL_STUB(i2c1,    0x100u);   /* I2C1    0x40081000 */
DECL_STUB(i2c2,    0x100u);   /* I2C2    0x40082000 */

/* ------------------------------------------------------------------ */
/* Region registration helper                                          */
/* ------------------------------------------------------------------ */

mm_bool mm_m2354_register_aliased(struct mmio_bus *bus, mm_u32 base,
                                  mm_u32 size, void *opaque,
                                  mm_bool (*read)(void *, mm_u32, mm_u32, mm_u32 *),
                                  mm_bool (*write)(void *, mm_u32, mm_u32, mm_u32))
{
    struct mmio_region reg;

    memset(&reg, 0, sizeof(reg));
    reg.base   = base;
    reg.size   = size;
    reg.opaque = opaque;
    reg.read   = read;
    reg.write  = write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = base + M2354_NS_OFFSET;
    return mmio_bus_register_region(bus, &reg);
}

static mm_bool stub_reg_one(struct mmio_bus *bus, struct periph_stub *ps,
                            mm_u32 base)
{
    return mm_m2354_register_aliased(bus, base, ps->size, ps,
                                     stub_read, stub_write);
}

/* ------------------------------------------------------------------ */
/* SYS                                                                 */
/* ------------------------------------------------------------------ */

/*
 * SYS_REGLCTL is a lock state machine, not a plain register.  The unlock
 * sequence is 0x59, 0x16, 0x88 and a read returns 1 while unlocked, 0 while
 * locked.  Firmware spins on that read (`do { ... } while (REGLCTL == 0)`),
 * so a register-file stub would either hang or unlock by accident.
 */
static void sys_reglctl_write(mm_u32 value)
{
    mm_u32 key = value & 0xFFu;

    if (sys_unlock_step == 0u && key == 0x59u) {
        sys_unlock_step = 1u;
        return;
    }
    if (sys_unlock_step == 1u && key == 0x16u) {
        sys_unlock_step = 2u;
        return;
    }
    if (sys_unlock_step == 2u && key == 0x88u) {
        sys_unlock_step = 0u;
        sys_unlocked = MM_TRUE;
        return;
    }
    /* Any other write (0 included) re-locks and restarts the sequence. */
    sys_unlock_step = 0u;
    sys_unlocked = MM_FALSE;
}

static mm_bool sys_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SYS_SIZE) return MM_FALSE;

    if (offset == SYS_REGLCTL) {
        *value_out = sys_unlocked ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == SYS_PLCTL) {
        /* The power-level write never takes time here. */
        *value_out = sys_regs[SYS_PLCTL / 4u] & ~SYS_PLCTL_WRBUSY;
        return MM_TRUE;
    }
    if (offset == SYS_PLSTS) {
        /* PLSTATUS tracks the requested PLSEL, PLCBUSY is never set. */
        mm_u32 sel = sys_regs[SYS_PLCTL / 4u] & 0x3u;
        *value_out = (sys_regs[SYS_PLSTS / 4u] & ~(SYS_PLSTS_PLCBUSY | (0x3u << 8))) |
                     (sel << 8);
        return MM_TRUE;
    }
    *value_out = 0u;
    memcpy(value_out, (mm_u8 *)sys_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool sys_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SYS_SIZE) return MM_FALSE;

    if (offset == SYS_REGLCTL) {
        sys_reglctl_write(value);
        return MM_TRUE;
    }
    if (offset == SYS_PDID) {
        /* Read-only */
        return MM_TRUE;
    }
    memcpy((mm_u8 *)sys_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* ------------------------------------------------------------------ */
/* CLK                                                                 */
/* ------------------------------------------------------------------ */

/*
 * CLK_STATUS is derived on every read rather than stored: firmware spins on
 * the stability bits after enabling a source, so each one simply follows its
 * enable bit.  The on-chip RC oscillators are reported stable unconditionally
 * -- they cannot realistically be unavailable, and pretending otherwise only
 * creates ways for firmware to spin forever.
 */
static mm_u32 clk_status_value(void)
{
    mm_u32 pwrctl = clk_regs[CLK_PWRCTL / 4u];
    mm_u32 pllctl = clk_regs[CLK_PLLCTL / 4u];
    mm_u32 sts = CLK_STATUS_HIRCSTB | CLK_STATUS_LIRCSTB | CLK_STATUS_MIRCSTB;

    if ((pwrctl & CLK_PWRCTL_HXTEN) != 0u)    sts |= CLK_STATUS_HXTSTB;
    if ((pwrctl & CLK_PWRCTL_LXTEN) != 0u)    sts |= CLK_STATUS_LXTSTB;
    if ((pwrctl & CLK_PWRCTL_HIRC48EN) != 0u) sts |= CLK_STATUS_HIRC48STB;
    if ((pllctl & CLK_PLLCTL_PD) == 0u)       sts |= CLK_STATUS_PLLSTB;
    return sts;
}

static mm_u64 clk_pll_hz(void)
{
    mm_u32 pllctl = clk_regs[CLK_PLLCTL / 4u];
    mm_u64 fin = ((pllctl >> 19) & 1u) != 0u ? M2354_FREQ_HIRC : M2354_FREQ_HXT;
    mm_u64 nf = (mm_u64)((pllctl & 0x1FFu) + 2u);        /* FBDIV + 2 */
    mm_u64 nr = (mm_u64)(((pllctl >> 9) & 0x1Fu) + 1u);  /* INDIV + 1 */
    mm_u64 no;

    if ((pllctl & CLK_PLLCTL_PD) != 0u) return 0ull;
    if ((pllctl & (1u << 17)) != 0u) return fin;         /* BP: bypass */

    /* TRM Rev 1.01 Table 6.3-3: NO is 1, 2, 2, 4 for OUTDIV 0..3. */
    switch ((pllctl >> 14) & 0x3u) {
    case 0u:  no = 1ull; break;
    case 3u:  no = 4ull; break;
    default:  no = 2ull; break;
    }
    if (nr == 0ull || no == 0ull) return 0ull;
    /* FOUT = FIN * 2 * NF / (NR * NO) */
    return (fin * 2ull * nf) / (nr * no);
}

static mm_bool clk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CLK_SIZE) return MM_FALSE;

    if (offset == CLK_STATUS) {
        *value_out = clk_status_value();
        return MM_TRUE;
    }
    *value_out = 0u;
    memcpy(value_out, (mm_u8 *)clk_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool clk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CLK_SIZE) return MM_FALSE;
    if (offset == CLK_STATUS) return MM_TRUE;   /* derived, read-only here */
    memcpy((mm_u8 *)clk_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

mm_bool mm_m2354_apb_periph_active(mm_u32 reg, mm_u32 bit)
{
    mm_u32 v = (reg == 0u) ? clk_regs[CLK_APBCLK0 / 4u]
                           : clk_regs[CLK_APBCLK1 / 4u];
    return ((v >> bit) & 1u) != 0u ? MM_TRUE : MM_FALSE;
}

mm_u64 mm_m2354_cpu_hz(void)
{
    mm_u32 sel = clk_regs[CLK_CLKSEL0 / 4u] & 0x7u;
    mm_u32 div = (clk_regs[CLK_CLKDIV0 / 4u] & 0xFu) + 1u;
    mm_u64 src;

    switch (sel) {
    case 0u: src = M2354_FREQ_HXT;    break;
    case 1u: src = M2354_FREQ_LXT;    break;
    case 2u: src = clk_pll_hz();      break;
    case 3u: src = M2354_FREQ_LIRC;   break;
    case 5u: src = M2354_FREQ_HIRC48; break;
    case 6u: src = M2354_FREQ_MIRC;   break;
    default: src = M2354_FREQ_HIRC;   break;
    }
    src /= div;
    /* Never report a stopped clock: the timebase divides by this. */
    if (src < 1000000ull) src = M2354_FREQ_HIRC;
    return src;
}

