danielinux/m33mu/cpu/m2354/m2354_mmio.c
/* ------------------------------------------------------------------ */
/* FMC                                                                 */
/* ------------------------------------------------------------------ */

static void m2354_flush_target(mm_u32 addr, mm_u32 size)
{
    if (g_map != 0 && g_map->code_cache != 0) {
        mm_code_cache_note_write(g_map->code_cache, addr, size);
        mm_code_cache_note_write(g_map->code_cache, addr + M2354_NS_OFFSET, size);
    }
    if (g_persist != 0 && addr < g_flash_size) {
        mm_u32 span = size;
        if (addr + span > g_flash_size) span = g_flash_size - addr;
        mm_flash_persist_flush((struct mm_flash_persist *)g_persist, addr, span);
    }
}

/*
 * Resolve an ISP address to a backing buffer.  The ISP engine works on
 * physical addresses, so the caller has already masked off the non-secure
 * alias bit.
 */
static mm_bool m2354_target_ptr(mm_u32 addr, mm_u32 size,
                                mm_u8 **buf_out, mm_u32 *off_out)
{
    if (buf_out == 0 || off_out == 0) return MM_FALSE;

    if (g_flash_ptr != 0 && addr < g_flash_size &&
        (g_flash_size - addr) >= size) {
        *buf_out = g_flash_ptr;
        *off_out = addr;
        return MM_TRUE;
    }
    if (addr >= M2354_LDROM_BASE &&
        (addr - M2354_LDROM_BASE) + size <= M2354_LDROM_SIZE) {
        *buf_out = ldrom_buf;
        *off_out = addr - M2354_LDROM_BASE;
        return MM_TRUE;
    }
    if (addr >= M2354_INFO_BASE &&
        (addr - M2354_INFO_BASE) + size <= M2354_INFO_SIZE) {
        *buf_out = info_buf;
        *off_out = addr - M2354_INFO_BASE;
        return MM_TRUE;
    }
    if (addr >= M2354_CONFIG_BASE &&
        (addr - M2354_CONFIG_BASE) + size <= M2354_CONFIG_SIZE) {
        *buf_out = config_buf;
        *off_out = addr - M2354_CONFIG_BASE;
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_u32 m2354_nscba(void)
{
    mm_u32 v;
    memcpy(&v, info_buf + M2354_NSCBA_OFFSET, sizeof(v));
    return v;
}

/*
 * Programming and erasing are gated per region by the ISPCTL update-enable
 * bits: APUEN for APROM, LDUEN for LDROM, CFGUEN for the user CONFIG words and
 * the XOM/NSCBA page.
 */
static mm_bool fmc_region_write_enabled(mm_u32 addr)
{
    mm_u32 ctl = fmc_regs[FMC_ISPCTL / 4u];

    if (addr < g_flash_size) {
        return ((ctl & FMC_ISPCTL_APUEN) != 0u) ? MM_TRUE : MM_FALSE;
    }
    if (addr >= M2354_LDROM_BASE &&
        (addr - M2354_LDROM_BASE) < M2354_LDROM_SIZE) {
        return ((ctl & FMC_ISPCTL_LDUEN) != 0u) ? MM_TRUE : MM_FALSE;
    }
    return ((ctl & FMC_ISPCTL_CFGUEN) != 0u) ? MM_TRUE : MM_FALSE;
}

static void fmc_fail(void)
{
    fmc_regs[FMC_ISPCTL / 4u] |= FMC_ISPCTL_ISPFF;
    fmc_regs[FMC_ISPSTS / 4u] |= FMC_ISPSTS_ISPFF;
}

/*
 * A non-secure ISP access may not touch flash below the NSCBA boundary.  This
 * is the one piece of SCU-style filtering the flash controller does itself.
 */
static mm_bool fmc_access_allowed(mm_u32 addr, mm_u32 size)
{
    mm_u32 nscba;

    if (mmio_active_sec() != MM_NONSECURE) return MM_TRUE;
    if (addr >= g_flash_size) return MM_FALSE;  /* info blocks are secure-only */
    nscba = m2354_nscba();
    if (nscba > M2354_FLASH_SIZE) return MM_FALSE;
    if (addr < nscba || (addr + size) > M2354_FLASH_SIZE) return MM_FALSE;
    return MM_TRUE;
}

static mm_bool fmc_read_word(mm_u32 addr, mm_u32 *out)
{
    mm_u8 *buf;
    mm_u32 off;
    if ((addr & 0x3u) != 0u) return MM_FALSE;
    if (!m2354_target_ptr(addr, 4u, &buf, &off)) return MM_FALSE;
    memcpy(out, buf + off, 4u);
    return MM_TRUE;
}

static mm_bool fmc_program(mm_u32 addr, const mm_u8 *src, mm_u32 len)
{
    mm_u8 *buf;
    mm_u32 off;
    mm_u32 i;

    if ((addr & 0x3u) != 0u) return MM_FALSE;
    if (!m2354_target_ptr(addr, len, &buf, &off)) return MM_FALSE;
    if (!fmc_region_write_enabled(addr)) return MM_FALSE;
    if (!fmc_access_allowed(addr, len)) return MM_FALSE;
    /* Programming flash can only clear bits. */
    for (i = 0; i < len; ++i) buf[off + i] &= src[i];
    m2354_flush_target(addr, len);
    return MM_TRUE;
}

static mm_bool fmc_erase(mm_u32 addr, mm_u32 len)
{
    mm_u8 *buf;
    mm_u32 off;

    if (!m2354_target_ptr(addr, len, &buf, &off)) return MM_FALSE;
    if (!fmc_region_write_enabled(addr)) return MM_FALSE;
    if (!fmc_access_allowed(addr, len)) return MM_FALSE;
    memset(buf + off, 0xFF, len);
    m2354_flush_target(addr, len);
    return MM_TRUE;
}

static mm_u32 fmc_scan(mm_u32 addr, mm_u32 len, mm_bool *blank_out)
{
    mm_u32 sum = 0u;
    mm_u32 i;
    mm_bool blank = MM_TRUE;

    for (i = 0; i < len; i += 4u) {
        mm_u32 w;
        if (!fmc_read_word(addr + i, &w)) {
            blank = MM_FALSE;
            break;
        }
        if (w != 0xFFFFFFFFu) blank = MM_FALSE;
        sum += w;
    }
    if (blank_out != 0) *blank_out = blank;
    return sum;
}

static void fmc_execute(void)
{
    mm_u32 cmd  = fmc_regs[FMC_ISPCMD / 4u] & 0xFFu;
    /* The ISP engine takes physical addresses; drop the alias bit. */
    mm_u32 addr = fmc_regs[FMC_ISPADDR / 4u] & ~M2354_NS_OFFSET;
    mm_u32 dat  = fmc_regs[FMC_ISPDAT / 4u];
    mm_bool blank = MM_FALSE;

    if ((fmc_regs[FMC_ISPCTL / 4u] & FMC_ISPCTL_ISPEN) == 0u) {
        fmc_fail();
        return;
    }

    switch (cmd) {
    case FMC_CMD_READ:
        if (!fmc_read_word(addr, &fmc_regs[FMC_ISPDAT / 4u])) fmc_fail();
        break;

    case FMC_CMD_READ_UID:
        /* Synthetic but stable unique ID, indexed by ISPADDR. */
        fmc_regs[FMC_ISPDAT / 4u] = 0x4D323335u ^ (addr * 0x01000193u);
        break;

    case FMC_CMD_READ_CID:
        fmc_regs[FMC_ISPDAT / 4u] = 0x000000DAu;
        break;

    case FMC_CMD_READ_DID:
        fmc_regs[FMC_ISPDAT / 4u] = SYS_PDID_VALUE;
        break;

    case FMC_CMD_RUN_ALL1:
        /* ISPDAT carries the byte count to check. */
        (void)fmc_scan(addr, dat, &blank);
        fmc_all1_result = blank ? FMC_ALL1_BLANK : 0u;
        if (blank) fmc_regs[FMC_ISPSTS / 4u] |= FMC_ISPSTS_ALLONE;
        else       fmc_regs[FMC_ISPSTS / 4u] &= ~FMC_ISPSTS_ALLONE;
        break;

    case FMC_CMD_READ_ALL1:
        fmc_regs[FMC_ISPDAT / 4u] = fmc_all1_result;
        break;

    case FMC_CMD_RUN_CKS:
        fmc_checksum = fmc_scan(addr, dat, 0);
        break;

    case FMC_CMD_READ_CKS:
        fmc_regs[FMC_ISPDAT / 4u] = fmc_checksum;
        break;

