danielinux/m33mu/cpu/m2354/m2354_mmio.c
    case FMC_CMD_PROGRAM:
        if (!fmc_program(addr, (const mm_u8 *)&dat, 4u)) fmc_fail();
        break;

    case FMC_CMD_PROGRAM_MUL: {
        mm_u32 w[4];
        w[0] = fmc_regs[FMC_MPDAT0 / 4u];
        w[1] = fmc_regs[FMC_MPDAT1 / 4u];
        w[2] = fmc_regs[FMC_MPDAT2 / 4u];
        w[3] = fmc_regs[FMC_MPDAT3 / 4u];
        if ((addr & (FMC_MULTI_WORD_SIZE - 1u)) != 0u ||
            !fmc_program(addr, (const mm_u8 *)w, FMC_MULTI_WORD_SIZE)) {
            fmc_fail();
        } else {
            fmc_regs[FMC_MPADDR / 4u] = addr + FMC_MULTI_WORD_SIZE;
        }
        break;
    }

    case FMC_CMD_PAGE_ERASE:
        if (!fmc_erase(addr & ~(M2354_FLASH_PAGE_SIZE - 1u),
                       M2354_FLASH_PAGE_SIZE)) {
            fmc_fail();
        }
        break;

    case FMC_CMD_BANK_ERASE:
        if (!fmc_erase(addr & ~(FMC_BANK_SIZE - 1u), FMC_BANK_SIZE)) fmc_fail();
        break;

    case FMC_CMD_VECMAP:
        /* ISPSTS.VECMAP is bits [23:9]: the remapped vector page address. */
        fmc_regs[FMC_ISPSTS / 4u] =
            (fmc_regs[FMC_ISPSTS / 4u] & ~FMC_ISPSTS_VECMAP_Msk) |
            (addr & FMC_ISPSTS_VECMAP_Msk);
        break;

    default:
        fmc_fail();
        break;
    }
}

static mm_bool fmc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FMC_SIZE) return MM_FALSE;

    if (offset == FMC_ISPTRG) {
        /* Commands complete synchronously, so ISPGO always reads back clear. */
        *value_out = 0u;
        return MM_TRUE;
    }
    if (offset == FMC_ISPSTS) {
        *value_out = fmc_regs[FMC_ISPSTS / 4u] & ~FMC_ISPSTS_ISPBUSY;
        return MM_TRUE;
    }
    *value_out = 0u;
    memcpy(value_out, (mm_u8 *)fmc_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool fmc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FMC_SIZE) return MM_FALSE;

    if (offset == FMC_ISPCTL) {
        mm_u32 cur = fmc_regs[FMC_ISPCTL / 4u];
        /* ISPFF is write-1-to-clear. */
        mm_u32 next = (value & ~FMC_ISPCTL_ISPFF) |
                      (cur & FMC_ISPCTL_ISPFF & ~value);
        fmc_regs[FMC_ISPCTL / 4u] = next;
        if ((value & FMC_ISPCTL_ISPFF) != 0u)
            fmc_regs[FMC_ISPSTS / 4u] &= ~FMC_ISPSTS_ISPFF;
        return MM_TRUE;
    }
    if (offset == FMC_ISPTRG) {
        memcpy((mm_u8 *)fmc_regs + offset, &value, size_bytes);
        if ((value & FMC_ISPTRG_ISPGO) != 0u) fmc_execute();
        fmc_regs[FMC_ISPTRG / 4u] = 0u;
        return MM_TRUE;
    }
    if (offset == FMC_ISPSTS) {
        /* ISPFF is the only writable bit, write-1-to-clear. */
        if ((value & FMC_ISPSTS_ISPFF) != 0u) {
            fmc_regs[FMC_ISPSTS / 4u] &= ~FMC_ISPSTS_ISPFF;
            fmc_regs[FMC_ISPCTL / 4u] &= ~FMC_ISPCTL_ISPFF;
        }
        return MM_TRUE;
    }
    memcpy((mm_u8 *)fmc_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* ------------------------------------------------------------------ */
/* SCU                                                                 */
/* ------------------------------------------------------------------ */

static mm_bool scu_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SCU_SIZE) return MM_FALSE;

    if (offset == SCU_FNSADDR) {
        /* Read-only live view of the NSCBA config word. */
        *value_out = m2354_nscba();
        return MM_TRUE;
    }
    *value_out = 0u;
    memcpy(value_out, (mm_u8 *)scu_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool scu_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SCU_SIZE) return MM_FALSE;
    if (offset == SCU_FNSADDR) return MM_TRUE;  /* read-only */
    memcpy((mm_u8 *)scu_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* ------------------------------------------------------------------ */
/* IDAU                                                                */
/* ------------------------------------------------------------------ */

/*
 * M2354 uses the plain alias IDAU: an address is non-secure exactly when it
 * falls in the +0x10000000 mirror of flash, SRAM or the peripheral window.
 *
 * Only those mirrors are claimed here.  m33mu lets the port hook override the
 * SAU completely (see target_attr_for_addr() in src/m33mu/mem_prot.c), so
 * returning MM_FALSE for the secure half is what leaves the SAU free to carve
 * an NSC region out of secure flash -- which is exactly what a TrustZone
 * bootloader does for its secure-gateway veneers.
 */
mm_bool mm_m2354_tz_attr_for_addr(mm_u32 addr,
                                  enum mm_sau_attr *attr_out,
                                  mm_u32 *region_out)
{
    mm_u32 region;

    if (attr_out == 0 || region_out == 0) return MM_FALSE;

    if (addr - M2354_FLASH_BASE_NS < M2354_FLASH_SIZE) {
        region = M2354_IDAU_REGION_FLASH_NS;
    } else if (addr - M2354_RAM_BASE_NS < M2354_RAM_SIZE) {
        region = M2354_IDAU_REGION_RAM_NS;
    } else if (addr - M2354_PERIPH_BASE_NS < M2354_PERIPH_SIZE) {
        region = M2354_IDAU_REGION_PERIPH_NS;
    } else {
        return MM_FALSE;
    }
    *attr_out = MM_SAU_NONSECURE;
    *region_out = region;
    return MM_TRUE;
}

/* ------------------------------------------------------------------ */
/* Registration, reset and binding                                     */
/* ------------------------------------------------------------------ */

mm_bool mm_m2354_register_mmio(struct mmio_bus *bus)
{
    if (!mm_m2354_register_aliased(bus, SYS_BASE, SYS_SIZE, 0,
                                   sys_read, sys_write)) return MM_FALSE;
    if (!mm_m2354_register_aliased(bus, CLK_BASE, CLK_SIZE, 0,
                                   clk_read, clk_write)) return MM_FALSE;
    if (!mm_m2354_register_aliased(bus, FMC_BASE, FMC_SIZE, 0,
                                   fmc_read, fmc_write)) return MM_FALSE;
    if (!mm_m2354_register_aliased(bus, SCU_BASE, SCU_SIZE, 0,
                                   scu_read, scu_write)) return MM_FALSE;

    if (!stub_reg_one(bus, &intctl_stub, 0x40000300u)) return MM_FALSE;
    if (!stub_reg_one(bus, &gpio_stub,   0x40004000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &pdma0_stub,  0x40008000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &ebi_stub,    0x40010000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &pdma1_stub,  0x40018000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &fvc_stub,    0x4002F500u)) return MM_FALSE;
    if (!stub_reg_one(bus, &dpm_stub,    0x4002F600u)) return MM_FALSE;
    if (!stub_reg_one(bus, &plm_stub,    0x4002F700u)) return MM_FALSE;
    if (!stub_reg_one(bus, &btf_stub,    0x4002F800u)) return MM_FALSE;
    if (!stub_reg_one(bus, &crc_stub,    0x40031000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &crpt_stub,   0x40032000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &wdt_stub,    0x40040000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &wwdt_stub,   0x40040100u)) return MM_FALSE;
    if (!stub_reg_one(bus, &rtc_stub,    0x40041000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &spi0_stub,   0x40061000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &spi1_stub,   0x40062000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &spi2_stub,   0x40063000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &spi3_stub,   0x40064000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &i2c0_stub,   0x40080000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &i2c1_stub,   0x40081000u)) return MM_FALSE;
    if (!stub_reg_one(bus, &i2c2_stub,   0x40082000u)) return MM_FALSE;

