danielinux/m33mu/cpu/m2354/m2354_mmio.c
    return MM_TRUE;
}

void mm_m2354_mmio_reset(void)
{
    memset(sys_regs, 0, sizeof(sys_regs));
    sys_regs[SYS_PDID / 4u]   = SYS_PDID_VALUE;
    sys_regs[SYS_RSTSTS / 4u] = 0x00000001u;  /* power-on reset flag */
    sys_regs[SYS_PLCTL / 4u]  = 0x00000002u;
    sys_regs[SYS_PLSTS / 4u]  = 0x00000200u;
    sys_unlock_step = 0u;
    sys_unlocked = MM_FALSE;

    memset(clk_regs, 0, sizeof(clk_regs));
    clk_regs[CLK_PWRCTL / 4u]  = 0x00200008u;
    clk_regs[CLK_AHBCLK / 4u]  = 0x00108000u;
    clk_regs[CLK_APBCLK0 / 4u] = 0x80000001u;
    clk_regs[CLK_CLKSEL0 / 4u] = 0x00200110u;
    clk_regs[0x14 / 4u]        = 0xA02222B3u; /* CLKSEL1 */
    clk_regs[0x18 / 4u]        = 0x44442BABu; /* CLKSEL2 */
    clk_regs[0x1C / 4u]        = 0x4402222Au; /* CLKSEL3 */
    clk_regs[CLK_PLLCTL / 4u]  = 0x0009440Au;

    memset(fmc_regs, 0, sizeof(fmc_regs));
    fmc_regs[FMC_ISPCTL / 4u] = FMC_ISPCTL_APUEN;
    fmc_regs[FMC_CYCCTL / 4u] = 0x00000001u;
    fmc_all1_result = 0u;
    fmc_checksum = 0u;

    memset(scu_regs, 0, sizeof(scu_regs));

    memset(intctl_regs, 0, sizeof(intctl_regs));
    memset(gpio_regs,   0, sizeof(gpio_regs));
    memset(pdma0_regs,  0, sizeof(pdma0_regs));
    memset(pdma1_regs,  0, sizeof(pdma1_regs));
    memset(ebi_regs,    0, sizeof(ebi_regs));
    memset(fvc_regs,    0, sizeof(fvc_regs));
    memset(dpm_regs,    0, sizeof(dpm_regs));
    memset(plm_regs,    0, sizeof(plm_regs));
    memset(btf_regs,    0, sizeof(btf_regs));
    memset(crc_regs,    0, sizeof(crc_regs));
    memset(crpt_regs,   0, sizeof(crpt_regs));
    memset(wdt_regs,    0, sizeof(wdt_regs));
    memset(wwdt_regs,   0, sizeof(wwdt_regs));
    memset(rtc_regs,    0, sizeof(rtc_regs));
    memset(spi0_regs,   0, sizeof(spi0_regs));
    memset(spi1_regs,   0, sizeof(spi1_regs));
    memset(spi2_regs,   0, sizeof(spi2_regs));
    memset(spi3_regs,   0, sizeof(spi3_regs));
    memset(i2c0_regs,   0, sizeof(i2c0_regs));
    memset(i2c1_regs,   0, sizeof(i2c1_regs));
    memset(i2c2_regs,   0, sizeof(i2c2_regs));

    g_map = 0;
    g_persist = 0;
    g_flash_ptr = 0;
    g_flash_size = 0u;
}

void mm_m2354_flash_bind(struct mm_memmap *map,
                         mm_u8 *flash, mm_u32 flash_size,
                         const struct mm_flash_persist *persist,
                         mm_u32 flags)
{
    (void)flags;
    g_map = map;
    g_flash_ptr = flash;
    g_flash_size = flash_size;
    g_persist = persist;

    if (!info_initialized) {
        mm_u32 nscba = M2354_NSCBA_DEFAULT;
        memset(ldrom_buf, 0xFF, sizeof(ldrom_buf));
        memset(info_buf, 0xFF, sizeof(info_buf));
        memset(config_buf, 0xFF, sizeof(config_buf));
        memcpy(info_buf + M2354_NSCBA_OFFSET, &nscba, sizeof(nscba));
        info_initialized = MM_TRUE;
    }
}
